# Introduction in Pandas

# Unit 1

## The first analitical case with Pandas

In [2]:
import pandas as pd

#### Statistics of the orders

In [ ]:
orders = pd.read_csv('orders.txt')
orders.head()

In [ ]:
len(orders)

#### Orders statuses

In [ ]:
billed = pd.read_csv('billed_orders.txt')
billed.head()

In [ ]:
billed.info()

#### Is there duplicates?

In [ ]:
orders.groupby(['tel', ' order']).count().head()

In [ ]:
?[ctrl+enter]orders.drop_duplicates

In [ ]:
%%time
orders.drop_duplicates(subset=['tel', 'order'], keep = 'first', inplace = True)
billed.drop_duplicates(subset='order', keep = 'first', inplace = True)

In [ ]:
joined = orders.merge(billed, on='order', how = 'inner')
joined.head()

#### Left only billed orders

In [ ]:
sales = joined[ joined['billed'] == 1 ]
sales.head()

#### Distribution of orders by region

In [ ]:
#сводная таблиуа, в строчках столбец city, в столбцах region
sales.pivot_table(index='city', columns='region', values = 'billed', aggfunc = 'count')

#### Creating the histogram/bar

In [ ]:
sales['region'].hist(bins=14)#bins - разделение столбцов гистограммы

#### The most active customers in Vladivostok

In [ ]:
# считаем кол-во строчек для каждого элемента столбца tel
sales[ sales['city'] == 'Владивосток']['tel'].value_counts()

# Unit 2

## Dataset's statistic

In [12]:
#import pandas as pd
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [7]:
data.shape

(1189482, 4)

In [8]:
data.describe()
#count - число непустых ячеек
#mean - среднее значение значений столбца
#std - стандартное отклонение
#min,max - минимальное и максимальное значение в столбце
# XX% - квантилии

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

In [9]:
data[ 'category' ].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71], dtype=int64)

In [10]:
len(data[ 'category' ].unique())

71

In [11]:
len(data[ 'country'].unique())

243

In [15]:
data[ 'country' ].value_counts()

Germany                                     20422
United States                               19847
Poland                                      19802
Austria                                     17440
Romania                                     17357
                                            ...
Antarctic Fisheries                            90
Pacific Islands (former)                       68
Yemen, Dem. (former)                           61
Yemen Arab Rep. (former)                       45
Commonwealth of Independent States (CIS)       16
Name: country, Length: 243, dtype: int64

In [17]:
data.columns[0]

'country'

In [35]:
trans_data = pd.read_csv(r'transactions.csv', sep = ';')
trans_data.head()

     Year  Month    ID Product  Amount   Price    Total    Cost
0  2012.0    1.0  t001      A1     7.0  2904.0  20328.0  1200.0
1  2012.0    1.0  t002      A2     2.0  1896.0   3792.0  1100.0
2  2012.0    2.0  t003      A1     5.0  2904.0  14520.0  1200.0
3  2012.0    2.0  t004      A4     1.0  8618.0   8618.0  4200.0
4  2012.0    2.0  t005      A5     3.0  5175.0  15525.0   500.0

In [19]:
len(trans_data)

63

In [36]:
trans_data['Product'].value_counts()

_5    11
_8     8
_2     8
_3     7
_4     7
A4     5
A5     5
A1     5
A2     2
_6     2
Name: Product, dtype: int64

# Unit 3

## Data filtering

In [23]:
average = data['quantity'].mean()
average

184264.77005012965

In [24]:
average = sum(data['quantity'])/len(data)
average

184264.77005012965

In [25]:
data.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

## Sorting

### Sorting by single column

In [27]:
#ascending по возрастанию(по умолчанию)
data.sort_values(by='quantity', ascending=False ).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

### Sorting by several columns

In [30]:
data.sort_values(by=['country', 'year'], ascending=[True, True]).head()

           country  year  quantity  category
9996   Afghanistan  1990       3.0         4
12134  Afghanistan  1990       3.0         4
14904  Afghanistan  1990       3.0         4
17054  Afghanistan  1990       3.0         4
21688  Afghanistan  1990       0.0         4

In [33]:
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

In [34]:
data.head()

            country  year   quantity  category
835137  Afghanistan  1990  3902100.0        42
492297  Afghanistan  1990   512000.0        31
491412  Afghanistan  1990   400000.0        31
492006  Afghanistan  1990   112000.0        31
491548  Afghanistan  1990    66000.0        31

In [43]:
trans_data[ trans_data['Product']=='_8'].sort_values(by='Cost', ascending=True).reset_index().loc[0]

index         22
Year        2012
Month          6
ID          t023
Product       _8
Amount        10
Price       3760
Total      37600
Cost         200
Name: 0, dtype: object

# Unit 5

In [44]:
#case - учитывать регистр
data[ data['country'].str.contains('lat', case = False)]['country'].unique()

array(['Latvia'], dtype=object)

In [45]:
data[ data['country'].str.contains('lit', case = False)]['country'].unique()

array(['Lithuania'], dtype=object)

In [46]:
data[ data['country'].str.contains('est', case=False)]['country'].unique()

array(['Estonia', 'State of Palestine', 'Timor-Leste'], dtype=object)

In [49]:
Baltic_states = data[ (data['country']=='Latvia') | 
                     (data['country']=='Lithuania') | 
                     (data['country']=='Estonia')]

In [50]:
Baltic_states

           country  year  quantity  category
553886     Estonia  1992   69255.0        32
555162     Estonia  1992   69255.0        32
557297     Estonia  1992   69255.0        32
536047     Estonia  1992   68447.0        32
561954     Estonia  1992   68447.0        32
...            ...   ...       ...       ...
987491   Lithuania  2014     -14.0        59
1006119  Lithuania  2014     -15.0        61
314512   Lithuania  2014     -53.0        24
758785   Lithuania  2014     -58.0        39
468270   Lithuania  2014    -733.0        27

[27306 rows x 4 columns]

In [52]:
Baltic_05_10 = Baltic_states[ (Baltic_states['year']>=2005) & (Baltic_states['year']<=2010)]

Baltic_05_10 = Baltic_05_10[Baltic_05_10['quantity']>0]

In [53]:
Baltic_05_10 = Baltic_05_10[(Baltic_05_10['category']==4)|
                            (Baltic_05_10['category']==12)|
                            (Baltic_05_10['category']==21)]

In [54]:
#Teacher book
countries = [x for x in data['country'].unique() if 'Lat' in x or 'Lit' in x or 'Est' in x]
countries

['Estonia', 'Latvia', 'Lithuania']

In [55]:
Baltic_05_10['quantity'].sum()

240580.0